app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC
---
  def index
  	@books = Book.all.order(created_at: :desc)

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "アイウエオ"], ["body", "かきくけこ"], ["created_at", "2019-04-06 03:22:27.886971"], ["updated_at", "2019-04-06 03:22:27.886971"]]
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC
---
  def create
  	@book = Book.new(book_params)
    if @book.save
  	 redirect_to book_path(@book.id), notice: "Book was successfully created."
    else
      @books = Book.all.order(created_at: :desc)